Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ИНН)
		И Не (ТолькоЦифры(ИНН) И (СтрДлина(ИНН) = 10 Или СтрДлина(ИНН) = 12)) Тогда
		Сообщить("ИНН должен состоять из 10 или 12 цифр");
		Отказ = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КПП)
		И Не (ТолькоЦифры(КПП) И СтрДлина(КПП) = 9) Тогда
		Сообщить("КПП должен состоять из 9 цифр");
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого Строка Из КонтактнаяИнформация Цикл
		
		Если Строка.Вид = "Телефон" И Не ЭтоТелефон(Строка.ЗначениеКонтактнойИнформации) Тогда
			Сообщить("Строка " + Строка.НомерСтроки + ": телефон должен содержать 11 цифр и начинаться с 89 или 79");
			Отказ = Истина;
		ИначеЕсли Строка.Вид = "Почта" И Не ЭтоПочта(Строка.ЗначениеКонтактнойИнформации) Тогда
			Сообщить("Строка " + Строка.НомерСтроки + ": неверный адрес почты");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТолькоЦифры(Строка)
	Для Сч = 1 По СтрДлина(Строка) Цикл
		Если СтрНайти("0123456789", Сред(Строка, Сч, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция ЭтоТелефон(Знач Строка)
	
	Для Каждого Символ Из СтрРазделить("+, ,-,(,)", ",") Цикл
		Строка = СтрЗаменить(Строка, Символ, "");
	КонецЦикла;
	
	Начало = Лев(Строка, 2);
	
	Возврат СтрДлина(Строка) = 11
		И ТолькоЦифры(Строка)
		И (Начало = "79" Или Начало = "89");
	
КонецФункции
Функция ЭтоПочта(Строка)
	Собака = СтрНайти(Строка, "@");
	Возврат Собака > 1 И СтрНайти(Сред(Строка, Собака), ".") > 0;
КонецФункции